In [5]:
import numpy as np
import pandas as pd

In [10]:
d={'A':[1,2,None],'B':[4,np.nan,5],'C':[6,7,8]}

In [12]:
df=pd.DataFrame(d)

In [13]:
df

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
2  NaN  5.0  8

In [15]:
# Drop all the missing values
df.dropna()
# If any row contain any missing value then it will drop that respective Row

     A    B  C
0  1.0  4.0  6

In [16]:
df

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
2  NaN  5.0  8

In [17]:
# By default the axis is 0 which means drop is done along with rows
# To Drop any column with Null values then use axis=1
df.dropna(axis=1)

   C
0  6
1  7
2  8

In [18]:
# thres : int ,default None
# require that many non-NA values
# the value set in the thres defines that the row should contain atleast 2 NULL values 
df.dropna(thresh=2)
df

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
2  NaN  5.0  8

In [19]:
# Instead of Dropping Rows we can also fill any Arbitrary value in it!
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         4.0  6
1         2.0  FILL VALUE  7
2  FILL VALUE         5.0  8

In [22]:
# A lot of time we might need to fill in the mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64